#+TITLE:PYTHON FUNCTIONS
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 109 - Introduction to programming in Python - Summer 2023
#+STARTUP: overview hideblocks indent inlineimages entitiespretty
#+PROPERTY: header-args:python :results output :exports both :session *Python*
* Define, Call, Pass, Argument, Parameter, Recursion

- It may sound trivial, but it's not trivial to keep these concepts
  apart:
  #+name: tab_terms
  | TERM/COMMAND        | MEANING                                         |
  |---------------------+-------------------------------------------------|
  | Function definition | Create a function with ~def~ [name]([args]):      |
  | Function call       | Executing function (with/out passing arguments) |
  | Function argument   | Value passed to a function in a function call   |
  | Function parameter  | Variables that have arguments assigned to them  |

- Analyse this function and decide how to call it - what is 'result'?
  #+begin_src python :results silent
    def result(result):
        print(result)
  #+end_src

- Example calls:
  #+begin_src python
    result(12)
    result(12 + 500)
    result('a')
    result('hello world')
    result('hello ' + 'world')
  #+end_src

- What's what:
  1) ~result~ is a function name
  2) ~result~ is a parameter of the function ~result~
  3) ~result~ is an argument of the function call ~print~

- Can you call ~result~ inside ~result~? ([[https://pythontutor.com/visualize.html#code=def%20result%28result%29%3A%0A%20%20%20%20print%28result%29%0A%20%20%20%20result%281%29%0Aresult%282%29&cumulative=false&curInstr=0&heapPrimitives=nevernest&mode=display&origin=opt-frontend.js&py=3&rawInputLstJSON=%5B%5D&textReferences=false][pythontutor.com]])
  #+begin_src python
    def result(result):
        print(result)
        result(1)
        result(2)
  #+end_src
  #+begin_quote
  - The ~TypeError: 'int' object is not callable~ is because at that
    point, ~result~ has been redefined as a parameter of the function,
    not the function itself.
  - When you try to call ~result(1)~ inside the function, you treat ~2~
    (the value passed as an argument to the function parameter) as a
    function - but ~2~ is an ~int~ and therefore not callable.
  #+end_quote

- A clearer version of this procedure:
  #+begin_src python
    def result(parameter):
        print(parameter)
        parameter(1) # Here parameter is not a function, it's the value
        # you passed (2)
    result(2)
  #+end_src

- How can you make a /recursive/ function that calls itself? ([[https://pythontutor.com/visualize.html#code=def%20result%28parameter%29%3A%0A%20%20%20%20print%28'Parameter%3A%20',%20parameter%29%0A%20%20%20%20if%20parameter%20%3E%200%3A%20%20%0A%20%20%20%20%20%20%20%20result%28parameter%20-%201%29%20%0Aresult%282%29&cumulative=false&curInstr=16&heapPrimitives=nevernest&mode=display&origin=opt-frontend.js&py=3&rawInputLstJSON=%5B%5D&textReferences=false][PythonTutor]])
  #+begin_src python
    def result(parameter):
        print(f'Parameter: {parameter}')
        if parameter > 0:  # a base case to stop recursion
            result(parameter - 1)  # call function itself, not the parameter
            result(2)
  #+end_src

  #+RESULTS:
  : Parameter: 2
  : Parameter: 1
  : Parameter: 0

* TODO Practice defining functions without parameters:

1) In Colab, write a function ~count~ that takes a string ~str~ as an
   argument and prints the number of its characters.

2) Call ~count~ on these arguments: ~a~, ~abcd~, ~a b c d~. Output:

3) Is it Okay to call this function ~count~?
   #+begin_quote
   - It's OK to call your own function by a name used by Python: it
     will not affect the built-in function of the same name.
   - However, in your current scope (i.e. your Python session), it
     will overshadow the built-in function.
   - It is considered poor practice to re-use function names. In a
     modern editor, the syntax highlighting will tip you off.
   #+end_quote

4) Is it Okay to call the function parameter ~str~?
   #+begin_quote
   - It is OK to call a parameter inside your own function by a known
     name - it won't affect its use outside of the function.
   - However, inside the function, your name will overshadow the
     previous name used by Python.
   - It is considered poor practice to re-use keywords as names. In a
     modern editor, the syntax highlighting will tip you off.
   #+end_quote

5) Solution ([[https://pythontutor.com/visualize.html#code=%23%20function%20def%0Adef%20count%20%28str%29%3A%0A%20%20%20%20%20print%28str%29%0A%20%20%20%20%20print%28str.count%28''%29-1%29%0A%23%20function%20call%0Acount%28str%3D'abcd'%29%0Acount%28''%29%0Aprint%28str%28'0'%29%29%0A&cumulative=false&curInstr=12&heapPrimitives=nevernest&mode=display&origin=opt-frontend.js&py=3&rawInputLstJSON=%5B%5D&textReferences=false][pythontutor with poor naming practice]]):
   #+begin_src python
     # function def
     def cnt (string):
         print(string.count('')-1)
         # function call
     cnt('a')
     cnt('abcd')
     cnt('a b c d')
     cnt(string='a b c d') # keyword parameter call
     print('abcd'.count('')-1)  # standard Python `str.count` function
   #+end_src

   #+RESULTS:
   : 1
   : 4
   : 7
   : 7
   : 4

* Local and Global Scope

Python functions have their own local scope, which means variables
defined within the function are only accessible within that
function. Parameters and variables assigned within a function are said
to exist in the local scope. Conversely, variables defined outside all
functions have a global scope and can be accessed from any part of the
program. It's important to understand the concept of scope to avoid
naming conflicts and understand variable visibility within your code.

- Example 3: can you define a function within another function?
  #+begin_src python
    # function definition
    def helloWorld():
        print('Hello, world!')
        def hello():
            return print('hello again')
        hello()
        # function call
    helloWorld()
  #+end_src

  #+RESULTS:
  : Hello, world!
  : hello again

